html/20231128T172943--docker-commands__docker.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://arvydasg.github.io/devnotes/html/rss.xml"
      title="RSS feed for https://arvydasg.github.io/devnotes/html">
<title>docker commands</title>
<meta name="author" content="Arvydas Gasparavicius">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="initial-scale=1,width=device-width,minimum-scale=1">
<link rel="stylesheet" href="../static/style.css"/>
<link rel="icon" href="../static/ag.ico">
</head>
<body>
<div id="preamble" class="status"><br>preamble here yo</br></div>
<div id="content">
<div class="post-date">15 Dec 2023</div><h1 class="post-title"><a href="https://arvydasg.github.io/devnotes/html/20231128T172943--docker-commands__docker.html">docker commands</a></h1>
<div class="org-src-container">
<pre class="src src-bash"># --------------------------------------------------------------------
# STATS
# active and running containers
docker ps
# previously ran images, you can start them and connect to them again
docker ps -a
# docker stats
docker stats
# list docker images available
docker images

# --------------------------------------------------------------------
# BUILD/RUN
# build an image with Dockerfile in the current dir
docker build .

# run the docker image
docker run &lt;image_id/name&gt;

# Run the container with --rm flag to automatically remove the container
# that was created when the container EXITS. Good for testing.
docker run --rm b3e0903d079d

# something
docker run -rm -it b3e0903d079d /bin/bash

# --------------------------------------------------------------------
# CONNECT TO THE DOCKER
# run in interactive mode, connect to it
docker run -ti ubuntu /bin/bash
docker run -ti ubuntu /bin/bash -c "apt update &amp;&amp; apt upgrade -y"

# run in interactive mode, connect to it, will be deleted after
# disconnect
docker run -ti --rm ubuntu /bin/bash

# attach to already created container!!!!
docker attach &lt;id&gt;

# --------------------------------------------------------------------
# CLEANUP

# remove docker containers from ps -a
docker rm -f &lt;id&gt;
# remove docker image
docker rmi &lt;image_name&gt;
# delete or remove all docker data like containers, images and volumes
# delete all containers
docker rm --force `docker ps -qa`
# delte all images
docker rmi --force `docker images -aq`
# idk prune smth
docker volume prune

# --------------------------------------------------------------------
# SAVE

# save an image of container. A commit is only necessary after each
# run if you want to make a snapshot there for future use, otherwise
# the container itself will stick around for you to keep using.
docker commit &lt;id&gt; new_name
</pre>
</div>
<div class="taglist"><a href="https://arvydasg.github.io/devnotes/html/tags.html">Tags</a>: <a href="https://arvydasg.github.io/devnotes/html/tag-docker.html">docker</a> </div></div>
<div id="postamble" class="status"><br>postamble in he house</br></div>
</body>
</html>
